package Arrays;
import java.util.Arrays;
//给出一个区间的集合，请合并所有重叠的区间。
//
//
//
// 示例 1:
//
// 输入: intervals = [[1,3],[2,6],[8,10],[15,18]]
//输出: [[1,6],[8,10],[15,18]]
//解释: 区间 [1,3] 和 [2,6] 重叠, 将它们合并为 [1,6].
//
//
// 示例 2:
//
// 输入: intervals = [[1,4],[4,5]]
//输出: [[1,5]]
//解释: 区间 [1,4] 和 [4,5] 可被视为重叠区间。
//
// 注意：输入类型已于2019年4月15日更改。 请重置默认代码定义以获取新方法签名。
//
//
//
// 提示：
//
//
// intervals[i][0] <= intervals[i][1]
//
// Related Topics 排序 数组
// 👍 573 👎 0
public class lc56 {
        public int[][] merge(int[][] intervals) {
            //按开始区间排序
            Arrays.sort(intervals,(v1,v2)->v1[0]-v2[0]);
            //复制数组
            int[][] res = new int[intervals.length][2];
            //操作res中的索引位置
            int index = -1;
            for(int[] interval :intervals){
                // 如果结果数组是空的，或者当前区间的起始位置 > 结果数组中最后区间的终止位置，
                // 则不合并，直接将当前区间加入结果数组。
                if(index == -1||interval[0]>res[index][1])
                    res[++index]=interval;
                else {
                    // 反之将当前区间合并至结果数组的最后区间
                    res[index][1]=Math.max(res[index][1],interval[1]);
                }
            }
            return Arrays.copyOf(res,index+1);
        }
    }

